app/Controllers/Admin.php

        }

        // Get all students and teachers for enrollment
        $students = $userModel->where('role', 'student')->where('status', 'active')->findAll();
        $teachers = $userModel->where('role', 'teacher')->where('status', 'active')->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'student'
AND `status` = 'active'
SELECT *
FROM `users`
WHERE `role` = 'teacher'
AND `status` = 'active'