app/Controllers/Admin.php

SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
LEFT JOIN `users` ON `courses`.`instructor_id` = `users`.`id`
ORDER BY `courses`.`created_at` DESC
---
    public function manageCourses()
    {
        $session = session();

        if (!$session->get('logged_in') || strtolower($session->get('user_role')) !== 'admin') {
            return redirect()->to('/admin_dashboard')->with('error', 'Access Denied.');
        }

        $db = \Config\Database::connect();

        // Check if courses table exists
        $courses = [];
        if ($db->query("SHOW TABLES LIKE 'courses'")->getNumRows() > 0) {
            try {
                $result = $db->table('courses')
                          ->select('courses.*, users.name as instructor_name')
                          ->join('users', 'courses.instructor_id = users.id', 'left')
                          ->orderBy('courses.created_at', 'DESC')
                          ->get();

                if ($result !== false && is_object($result)) {
                    $courses = $result->getResultArray();

SELECT *
FROM `acad_years`
ORDER BY `acad_year` DESC
---
            if ($db->query("SHOW TABLES LIKE 'acad_years'")->getNumRows() > 0) {
                $result = $db->table('acad_years')->orderBy('acad_year', 'DESC')->get();
                if ($result !== false && is_object($result)) {
                    $acadYears = $result->getResultArray();

SELECT `semesters`.`id`, `semesters`.`semester`, `semesters`.`semester_code`, `semesters`.`acad_year_id`, `semesters`.`is_active`, acad_years.acad_year
FROM `semesters`
LEFT JOIN `acad_years` ON `semesters`.`acad_year_id` = `acad_years`.`id`
ORDER BY `semesters`.`start_date` DESC
---
                    $semesters = $result->getResultArray();
                } else {
                    // Fallback: try without join
                    $result = $db->table('semesters')
                        ->select('semesters.id, semesters.semester, semesters.semester_code, semesters.acad_year_id, semesters.is_active')
                        ->orderBy('semesters.start_date', 'DESC')
                        ->get();

SELECT `terms`.`id`, `terms`.`term`, `terms`.`term_code`, `terms`.`semester_id`, `terms`.`is_active`, semesters.semester, semesters.acad_year_id, acad_years.acad_year
FROM `terms`
LEFT JOIN `semesters` ON `terms`.`semester_id` = `semesters`.`id`
LEFT JOIN `acad_years` ON `semesters`.`acad_year_id` = `acad_years`.`id`
ORDER BY `terms`.`start_date` DESC
---
                    $terms = $result->getResultArray();
                } else {
                    // Fallback: try without joins
                    $result = $db->table('terms')
                        ->select('terms.id, terms.term, terms.term_code, terms.semester_id, terms.is_active')
                        ->orderBy('terms.start_date', 'DESC')
                        ->get();

SELECT *
FROM `users`
WHERE `role` = 'teacher'
OR `role` = 'Teacher'
ORDER BY `name` ASC
---

        try {
            // Fetch teachers (users with role 'teacher')
            $result = $db->table('users')
                ->where('role', 'teacher')
                ->orWhere('role', 'Teacher')
                ->orderBy('name', 'ASC')
                ->get();