app/Controllers/Auth.php

SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function dashboard()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login')->with('error', 'Please login first.');
        }

        $userRole = session()->get('user_role');
        $userId = session()->get('user_id');

        $data = [
            'user_name' => session()->get('user_name'),
            'user_role' => $userRole,
            'total_users' => 0,
            'total_projects' => 0,
            'total_notifications' => 0,
            'my_courses' => 0,
            'my_notifications' => 0,
        ];