app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function dashboard()
    {
        $session = session();

        // 🔐 Check login
        if (!$session->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Please login first.');
        }

        $db                = \Config\Database::connect();
        $userModel         = new UserModel();
        $announcementModel = new AnnouncementModel();
        $enrollmentModel   = new EnrollmentModel();

        $userId   = $session->get('user_id');
        $user     = $userModel->find($userId);