app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `users`.`id` = '4'
---
    public function dashboard()
    {
        $session = session();

        // 🔐 Check login
        if (!$session->get('logged_in')) {
            return redirect()->to('/auth/login')->with('error', 'Please login first.');
        }

        $db                = \Config\Database::connect();
        $userModel         = new UserModel();
        $announcementModel = new AnnouncementModel();
        $enrollmentModel   = new EnrollmentModel();

        $userId   = $session->get('user_id');
        $userRole = strtolower($session->get('user_role'));
        $user     = $userModel->find($userId);

SELECT `courses`.`id`, `courses`.`title`, `courses`.`description`
FROM `enrollments`
JOIN `courses` ON `enrollments`.`course_id` = `courses`.`id`
WHERE `enrollments`.`user_id` = '4'
SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
---
            }

            if ($db->query("SHOW TABLES LIKE 'enrollments'")->getNumRows() > 0) {
                $enrolledCourses = $enrollmentModel
                    ->select('courses.id, courses.title, courses.description')
                    ->join('courses', 'enrollments.course_id = courses.id')
                    ->where('enrollments.user_id', $userId)
                    ->findAll();
            }

            $announcements = $announcementModel->orderBy('created_at', 'DESC')->findAll();