app/Controllers/Course.php

            // Get enrolled courses for students
            $enrolledCourses = [];
            if ($userRole === 'student' && $db->query("SHOW TABLES LIKE 'enrollments'")->getNumRows() > 0) {
                $enrolledCourses = $enrollmentModel->select('courses.id')
                    ->join('courses', 'enrollments.course_id = courses.id')
                    ->where('enrollments.user_id', $userId)
                    ->findAll();
---
SELECT `courses`.`id`
FROM `enrollments`
JOIN `courses` ON `enrollments`.`course_id` = `courses`.`id`
WHERE `enrollments`.`user_id` = '4'