app/Models/MaterialModel.php

    public function getMaterialsByCourse($course_id, $includeDeleted = false)
    {
        $query = $this->where('course_id', $course_id);

        if (!$includeDeleted) {
            // Include materials with status 'active' or NULL (for backward compatibility with existing records)
            $query->groupStart()
                  ->where('status', 'active')
                  ->orWhere('status IS NULL')
                  ->groupEnd();
        }

        return $query->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `materials`
WHERE `course_id` = '8'
AND   (
`status` = 'active'
OR `status` IS NULL
 )
ORDER BY `created_at` DESC