app/Models/OtpTokenModel.php

UPDATE `otp_tokens` SET `is_used` = 1
WHERE `user_id` = '3'
AND `is_used` = 0
---
    public function generateOtp($userId, $email)
    {
        try {
            $db = \Config\Database::connect();

            // Generate 6-digit OTP
            $otpCode = str_pad((string)rand(0, 999999), 6, '0', STR_PAD_LEFT);

            // Set expiration to 10 minutes from now
            $expiresAt = date('Y-m-d H:i:s', strtotime('+10 minutes'));

            // Invalidate any existing unused OTPs for this user
            try {
                $db->table('otp_tokens')
                   ->where('user_id', $userId)
                   ->where('is_used', 0)
                   ->update(['is_used' => 1]);