app/Models/UserModel.php

    public function findUserByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'student@example.com'
 LIMIT 1

    public function getDashboardStats($userRole, $userId = null)
    {
        $db = \Config\Database::connect();
        $stats = [];

        try {
            $tableExists = fn($table) =>
                $db->query("SHOW TABLES LIKE '{$table}'")->getNumRows() > 0;

            if ($userRole === 'admin') {
                // ADMIN: overall system stats
                $stats['total_users']     = $this->countAll();
                $stats['active_students'] = $this->where(['role' => 'student', 'status' => 'active'])->countAllResults();
                $stats['active_teachers'] = $this->where(['role' => 'teacher', 'status' => 'active'])->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
AND `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'teacher'
AND `status` = 'active'